import java.util.Scanner;

public class task2 {
//    Клиентът ви е строителна компания, която иска от вас да
//направите каталог на апартаментите в новопостроената им
//жилищна сграда.
//Сградата е на 6 етажа. На всеки етаж има по 10
//апартамента.
//Номерацията е номер на етаж + число от 1 до 10 (напр. за 2
//етаж са 201, 202 и т.н. до 210, за етаж 6 са от 601 до 610 и т.н.).

//    Апартаментите са ориентирани по следния начин:
//- апартаментите с номера от 1 до 5 са ориентирани на запад
//- апартаментите с номера от 6 до 10 са ориентирани на изток
//Апартамент 10 е четиристаен. От останалите апартаменти,
//тези с
//четни номера са двустайни, а тези с нечетни - тристайни.
//Каталогът трябва да съдържа списък на всички апартаменти
//в сградата и
//да има следния формат: Floor, Apartment number, Rooms,
//Orientation

//    Отпечатайте в конзолата резултатите за всички етажи от 1
//до 6 последователно.
//В резултата е включен и заглавния ред, съдържащ имената
//на колоните
//(данните).
//    Пример за етаж 3:
//Floor, Apartment number, Rooms, Orientation
//3, 301, 3, west
//3, 302, 2, west
//3, 303, 3, west
//3, 304, 2, west
//3, 305, 3, west
//3, 306, 2, east
//3, 307, 3, east
//3, 308, 2, east
//3, 309, 3, east
//3, 310, 4, east

    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int r;
        String o;
        System.out.println("Choose floor /1-6/:");
        int floor = sc.nextInt();
        System.out.println("Floor, Apartment number, Rooms, Orientation");
        for (int ap = 1; ap <= 10; ap++) {
            if (ap / 2 == 0) {
                r = 3;
            } else r = 2;
            if (ap > 5) {
                o = "east";
            } else o = "west";
            if (ap == 10) {
                r = 4;
            }
            System.out.println(floor + ", " + (floor * 100 + ap) + ", " + r + ", " + o);

        }
    }
}


